<?php

// while
$i = 0;
while ($i < 10) {
    echo $i . " ";
    $i++;
}

echo "\n\n\n ========Прерываем цикл ============== \n\n\n";

$i = 1000;
while ($i > 0) {
    if ($i === 500) break;
    echo $i . " ";
    $i -= 100;
}
echo "\n\n\n ========Прерываем итерацию ============== \n\n\n";
//
$i = 1000;
//while ($i > 0) {
//    if ($i === 500) continue;       // следующие строки не отработают поэтому получим зависание тк консоль срабатывает бесконечно
//    echo $i . " ";
//    $i -= 100;
//}$i = 1000;

while ($i > 0) {
    $i -= 100;
    if ($i === 500) continue;
    echo $i . " ";

}

echo "\n\n\n ===== Находим сумму ===== \n\n\n";

$s = 0;
$i = 0;
while ($i <= 15) {
    $s += $i;
    $i++;
}
echo $s;

echo "\n\n\n ===== Находим сумму 2 ===== \n\n\n";

$s = 0;
$i = 0;
while ($s <= 1000) {
    $s = $s + $i;
    $i++;
}
echo $s, "\n";
echo $i;

echo "\n\n\n ===== do while ===== \n\n\n";

$i = 0;
do {
    echo $i . " ";
    $i++;
} while ($i < 10);